# language: ru
@web
Функционал: Калькулятор в виде web приложения
  Что бы не возить с собой калькулятор
  Все, у кого есть доступ в интернет
  Хотят использовать калькулятор в интеренете

  Сценарий: Сложение двух целых чисел в интернете
    Допустим я перехожу на страницу с калькулятором
    И я ввожу в веб форму первое число 100
    И затем ввожу в веб форму второе число 4
    Если я нажимаю кнопку "Сложить"
    То в веб форме я увижу результат число 104

  Сценарий: Умножение двух целых чисел в интернете
    Допустим я перехожу на страницу с калькулятором
    И я ввожу в веб форму первое число 30
    И затем ввожу в веб форму второе число 27
    Если я нажимаю кнопку "Умножить"
    То в веб форме я увижу результат число 810